openwch/arduino_core_ch32/cores/arduino/ch32/lib/ch32yyxx.h
#ifndef _CH32YYXX_H_
#define _CH32YYXX_H_

/* Include Low Layers drivers */
#include "ch32yyxx_adc.h"
#include "ch32yyxx_bkp.h"
#include "ch32yyxx_can.h"
#include "ch32yyxx_crc.h"
#include "ch32yyxx_dac.h"
#include "ch32yyxx_dbgmcu.h"
#include "ch32yyxx_dma.h"
#include "ch32yyxx_dvp.h"
#include "ch32yyxx_eth.h"
#include "ch32yyxx_exti.h"
#include "ch32yyxx_flash.h"
#include "ch32yyxx_fsmc.h"
#include "ch32yyxx_gpio.h"
#include "ch32yyxx_i2c.h"
#include "ch32yyxx_iwdg.h"
#include "ch32yyxx_misc.h"
#include "ch32yyxx_opa.h"
#include "ch32yyxx_pwr.h"
#include "ch32yyxx_rcc.h"
#include "ch32yyxx_rng.h"
#include "ch32yyxx_rtc.h"
#include "ch32yyxx_sdio.h"
#include "ch32yyxx_spi.h"
#include "ch32yyxx_tim.h"
#include "ch32yyxx_usart.h"
#include "ch32yyxx_wwdg.h"

#include "ch32yyxx_debug.h"
#include "system_ch32yyxx.h"
#include "core_riscv_cH32yyxx.h"
#include "ch32yyxx_it.h"


#endif /* _CH32YYXX_H_ */
